{
  "curriculum_vitae": {
    "personal_info": {
      "name": "Gareth Bizley",
      "role_title": "Android Developer",
      "address": "3/1 43 Queen Elizabeth Gardens",
      "city": "Glasgow",
      "phone": "+447552307536",
      "email": "gaz.biz@gmail.com"
    },
    "introduction": "I’ve been working as an Android dev for almost 6  years. I’m a very fast learner and work extremely  well with other team members. I enjoy both learning and passing knowledge on to others. I am an avid fantasy reader, film buff & gamer. I believe I have a few more years to round my skills out as a senior but am always looking for opportunities to capitalise on my soft skills and eventually move to a team lead role. ",
    "development": "I’m a big fan of everything Android Jetpack. Leveraging these tools allows me to deliver with both speed and confidence. I am most comfortable with modern MVVM/MVI architectures but have worked on projects that use many different approaches. I embrace TDD in all work I do. I enjoy learning from and  mentoring all levels of devs and have spent the last 4 years involved in a mentoring program with Glasgow inner city highschools.",
    "skills": [
      {
        "title": "Android Libraries",
        "skill_list": [
          "Android Jetpack",
          "Dagger/Hilt",
          "DataBinding",
          "Compose",
          "Cucumber",
          "Google Truth",
          "JUnit",
          "LiveData",
          "Mockito",
          "Proguard",
          "Retrofit",
          "RxJava"
        ]
      },
      {
        "title": "Languages",
        "skill_list": [
          "Kotlin",
          "Java",
          "JSON",
          "XML",
          "HTML",
          "SQL",
          "Groovy"
        ]
      },
      {
        "title": "Other Tools",
        "skill_list": [
          "Jira",
          "Confluence",
          "Git",
          "Postman",
          "UML",
          "Android Studio",
          "Gradle",
          "TDD",
          "BDD",
          "Bitrise",
          "Firebase",
          "Google Console"
        ]
      }
    ],
    "experience": [
      {
        "from": "August 2022",
        "to": "April 2023",
        "company_name": "Deliveroo",
        "location": "Fully Remote",
        "title": "Android Developer",
        "skills": [
          "Kotlin",
          "Groovy",
          "XML",
          "Bitrise"
        ],
        "description": "Worked on a new app for the grocery delivery space. ",
        "bullets": [
          "Owned the creation of a release test process. Greenfield app  had required several hot fixes in production prior to this, and has required none since.",
          "Worked closely with the localisation team  to implement a standardised process for app localisation.",
          "Worked closely with legal teams and product managers to ensure readiness for google play store release.",
          "Worked with events reporting teams to ensure their additions to the android app played nicely with existing  architecture and design paradigms."
        ]
      },
      {
        "from": "June 2020 ",
        "to": "August 2022",
        "company_name": "BBC",
        "location": "Glasgow",
        "title": "Senior Android Developer",
        "skills": [
          "Kotlin",
          "Java",
          "XML",
          "Compose",
          "Interop",
          "TDD"
        ],
        "description": "Maintained and enhanced an authentication library used by all BBC Android apps & later worked on iPlayer & Sounds android apps.",
        "bullets": [
          "Transitioned into a new team spread across the UK mid pandemic and was up and running with first code commits within a week",
          "Quickly took on a leadership role as the key android developer within the auth library squad",
          "Worked with apprentices/graduates in a mentoring  role",
          "Owned the bulk of engineering decisions within the authentication library",
          "Gained extensive experience working with legacy code",
          "Identified, actioned and led work to shore up existing security flaws"
        ]
      },
      {
        "from": "January 2019 ",
        "to": "June 2020",
        "company_name": "Scottish Power",
        "location": "Glasgow",
        "title": "Android Developer",
        "skills": [
          "Kotlin",
          "SQL",
          "Jetpack",
          "Cucumber"
        ],
        "description": "Maintained and grew Iberdrola Ireland and Scottish Power consumer apps",
        "bullets": [
          "Took the role of  ‘Squad Leader’ for the mobile development team, assisting in story readiness and high level technical solution",
          "Took several features from initial pitch through UX review and API design to implementation and delivery in a fast paced environment",
          "Maintained and built upon 2 live apps with over 250k users",
          "Boosted code coverage of unit testing in both projects",
          "Contributed to production code within a few weeks after upskilling with an unfamiliar bleeding edge tech stack",
          "Interfacing with multiple 3rd party SDK’s",
          "Onboarding and mentoring juniors, mid level and new starts",
          "Documentation of technical solutions (UML  and plain text)",
          "Processing of payments and 3rd party appointment bookings in app"
        ]
      },
      {
        "from": "November 2016 ",
        "to": "November 20218",
        "company_name": "Resdiary",
        "location": "Glasgow",
        "title": "Junior Android Developer",
        "skills": [
          "Java",
          "XML"
        ],
        "description": "Launched and maintained android app",
        "bullets": [
          "Assisted a small, inexperienced team in releasing their first app to play store",
          "Maintained the first app release and laid the groundwork for a more complex application while learning  RXJava and Kotlin",
          "As a one person team, refactored legacy app to reduce crash rate by 50%"
        ]
      },
      {
        "from": "January 2008",
        "to": "November 2016",
        "company_name": "Settlers Tavern",
        "location": "Margaret River",
        "title": "Assistant General Manager",
        "skills": [],
        "description": "Ran the famous 'Tav' as it doubled in business",
        "bullets": [
          "Running an extremely busy restaurant serving 700 - 1000 meals per day during peak season",
          "Rostered, trained and managed up to 40 FOH staff at a time, keeping wage costs to a minimum",
          "Managed the venue’s live music program for 2 years, during which we won best live music venue in Australia"
        ]
      }
    ],
    "education": [
      {
        "from": "July 2012",
        "to": "July 2017",
        "provider": "RMIT",
        "course_name": "Bachelor of Computer Studies",
        "description": "Focus on programming, software architecture and agile methodologies. Minor in Economics from University of South Australia. Finished with a HD average. "
      }
    ],
    "references": [
      {
        "name": "Chris Vaughan",
        "role": "Principal Android Developer",
        "relationship": "Mentor at BBC",
        "contact": "chris.vaughan01@bbc.co.uk"
      },
      {
        "name": "Moyi Liu",
        "role": "Senior Android Developer",
        "relationship": "Mentor at Scottish Power",
        "contact": "+44 7544 275 000"
      }
    ]
  }
}